src/example_projects/learning-kredis/app/controllers/searches_controller.rb

    def current_user
      # Mock current_user for example purpose
      @current_user ||= User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]